badgeteam/mch2022-firmware-esp32/main/menus/sao.c
#include "sao.h"

#include <esp_err.h>
#include <esp_log.h>
#include <esp_system.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/task.h>
#include <sdkconfig.h>
#include <stdio.h>
#include <string.h>

#include "app_management.h"
#include "appfs.h"
#include "appfs_wrapper.h"
#include "cJSON.h"
#include "graphics_wrapper.h"
#include "gui_element_header.h"
#include "hardware.h"
#include "http_download.h"
#include "menu.h"
#include "pax_codecs.h"
#include "pax_gfx.h"
#include "rp2040.h"
#include "sao_eeprom.h"
#include "settings.h"
#include "system_wrapper.h"
#include "wifi_connect.h"

void program_small() {
    sao_driver_storage_data_t data = {.flags         = 0,
                                      .address       = 0x50,
                                      .size_exp      = 11,  // 2 kbit (2^11)
                                      .page_size_exp = 4,   // 16 bytes (2^4)
                                      .data_offset   = 4,   // 4 pages (64 bytes)
                                      .reserved      = 0};
    sao_format("Generic small EEPROM (2kb)", SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data, sizeof(data), NULL, NULL, 0, NULL, NULL, 0, true);
}

void program_googly() {
    sao_driver_storage_data_t data = {.flags         = 0,
                                      .address       = 0x50,
                                      .size_exp      = 15,  // 32 kbit (2^15)
                                      .page_size_exp = 6,   // 64 bytes (2^6)
                                      .data_offset   = 1,   // 1 page (64 bytes)
                                      .reserved      = 0};
    sao_format("Googly eye", SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data, sizeof(data), NULL, NULL, 0, NULL, NULL, 0, false);
}

void program_cloud() {
    sao_driver_storage_data_t data = {.flags         = 0,
                                      .address       = 0x50,
                                      .size_exp      = 15,  // 32 kbit (2^15)
                                      .page_size_exp = 6,   // 64 bytes (2^6)
                                      .data_offset   = 1,   // 1 page (64 bytes)
                                      .reserved      = 0};

    sao_driver_basic_io_data_t data_basic_io = {
        .io1_function = SAO_DRIVER_BASIC_IO_FUNC_LED_BLUE, .io2_function = SAO_DRIVER_BASIC_IO_FUNC_LED_BLUE, .reserved = 0};

    sao_format("Cloud", SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data, sizeof(data), SAO_DRIVER_BASIC_IO_NAME, (uint8_t*) &data_basic_io,
               sizeof(sao_driver_basic_io_data_t), NULL, NULL, 0, false);
}

void program_cloud_tilde() {
    sao_driver_neopixel_data_t data_neopixel = {.length      = 2,
                                                .color_order = SAO_DRIVER_NEOPIXEL_COLOR_ORDER_GRB,  // WS2812
                                                .reserved    = 0};

    sao_driver_storage_data_t data_storage = {.flags         = 0,
                                              .address       = 0x50,
                                              .size_exp      = 15,  // 32 kbit (2^15)
                                              .page_size_exp = 6,   // 64 bytes (2^6)
                                              .data_offset   = 1,   // 1 page (64 bytes)
                                              .reserved      = 0};

    sao_format("Cloud", SAO_DRIVER_NEOPIXEL_NAME, (uint8_t*) &data_neopixel, sizeof(data_neopixel), SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data_storage,
               sizeof(data_storage), NULL, NULL, 0, false);
}

void program_cloud_tilde_small() {
    sao_driver_neopixel_data_t data_neopixel = {.length      = 2,
                                                .color_order = SAO_DRIVER_NEOPIXEL_COLOR_ORDER_GRB,  // WS2812
                                                .reserved    = 0};

    sao_driver_storage_data_t data_storage = {.flags         = 0,
                                              .address       = 0x50,
                                              .size_exp      = 11,  // 2 kbit (2^11)
                                              .page_size_exp = 4,   // 16 bytes (2^4)
                                              .data_offset   = 4,   // 4 pages (64 bytes)
                                              .reserved      = 0};

    sao_format("Cloud", SAO_DRIVER_NEOPIXEL_NAME, (uint8_t*) &data_neopixel, sizeof(data_neopixel), SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data_storage,
               sizeof(data_storage), NULL, NULL, 0, true);
}

void program_cassette() {
    sao_driver_storage_data_t data = {.flags         = 0,
                                      .address       = 0x50,
                                      .size_exp      = 15,  // 32 kbit (2^15)
                                      .page_size_exp = 6,   // 64 bytes (2^6)
                                      .data_offset   = 1,   // 1 page (64 bytes)
                                      .reserved      = 0};

    sao_driver_basic_io_data_t data_basic_io = {
        .io1_function = SAO_DRIVER_BASIC_IO_FUNC_LED_RED, .io2_function = SAO_DRIVER_BASIC_IO_FUNC_LED_RED, .reserved = 0};

    sao_format("Cassette", SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data, sizeof(data), SAO_DRIVER_BASIC_IO_NAME, (uint8_t*) &data_basic_io,
               sizeof(sao_driver_basic_io_data_t), NULL, NULL, 0, false);
}

void program_diskette() {
    sao_driver_storage_data_t data = {.flags         = 0,
                                      .address       = 0x50,
                                      .size_exp      = 15,  // 32 kbit (2^15)
                                      .page_size_exp = 6,   // 64 bytes (2^6)
                                      .data_offset   = 1,   // 1 page (64 bytes)
                                      .reserved      = 0};

    sao_driver_basic_io_data_t data_basic_io = {
        .io1_function = SAO_DRIVER_BASIC_IO_FUNC_LED_RED, .io2_function = SAO_DRIVER_BASIC_IO_FUNC_LED_GREEN, .reserved = 0};

    sao_format("Diskette", SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data, sizeof(data), SAO_DRIVER_BASIC_IO_NAME, (uint8_t*) &data_basic_io,
               sizeof(sao_driver_basic_io_data_t), NULL, NULL, 0, false);
}

void program_ssd1306() {
    sao_driver_ssd1306_data_t data_ssd1306 = {.address = 0x3C, .height = 64, .reserved = 0};

    sao_driver_storage_data_t data_storage = {.flags         = 0,
                                              .address       = 0x50,
                                              .size_exp      = 15,  // 32 kbit (2^15)
                                              .page_size_exp = 6,   // 64 bytes (2^6)
                                              .data_offset   = 1,   // 1 page (64 bytes)
                                              .reserved      = 0};

