badgeteam/mch2022-firmware-esp32/main/menus/sao.c
    sao_driver_basic_io_data_t data_basic_io = {
        .io1_function = SAO_DRIVER_BASIC_IO_FUNC_LED_RED, .io2_function = SAO_DRIVER_BASIC_IO_FUNC_LED_BLUE, .reserved = 0};

    sao_format("OLED display", SAO_DRIVER_SSD1306_NAME, (uint8_t*) &data_ssd1306, sizeof(data_ssd1306), SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data_storage,
               sizeof(data_storage), SAO_DRIVER_BASIC_IO_NAME, (uint8_t*) &data_basic_io, sizeof(sao_driver_basic_io_data_t), false);
}

void program_ntag() {
    sao_driver_ntag_data_t data_ntag = {.address       = 0x55,
                                        .size_exp      = 10,  // 1k (NT3H2111)
                                        .interrupt_pin = 2,   // Interrupt pin is on IO2
                                        .reserved      = 0};

    sao_driver_storage_data_t data_storage = {.flags         = 0,
                                              .address       = 0x50,
                                              .size_exp      = 15,  // 32 kbit (2^15)
                                              .page_size_exp = 6,   // 64 bytes (2^6)
                                              .data_offset   = 1,   // 1 page (64 bytes)
                                              .reserved      = 0};

    sao_driver_basic_io_data_t data_basic_io = {.io1_function = SAO_DRIVER_BASIC_IO_FUNC_LED_WHITE,
                                                .io2_function = SAO_DRIVER_BASIC_IO_FUNC_NONE,  // Used by the NTAG driver
                                                .reserved     = 0};

    sao_format("NFC tag", SAO_DRIVER_NTAG_NAME, (uint8_t*) &data_ntag, sizeof(data_ntag), SAO_DRIVER_STORAGE_NAME, (uint8_t*) &data_storage,
               sizeof(data_storage), SAO_DRIVER_BASIC_IO_NAME, (uint8_t*) &data_basic_io, sizeof(sao_driver_basic_io_data_t), false);
}

typedef enum action {
    ACTION_NONE = 0,
    ACTION_BACK,
    ACTION_GOOGLY,
    ACTION_CLOUD,
    ACTION_CLOUD_TILDE,
    ACTION_CLOUD_TILDE_SMALL,
    ACTION_CASSETTE,
    ACTION_DISKETTE,
    ACTION_SSD1306,
    ACTION_NTAG,
    ACTION_SMALL
} menu_dev_action_t;

static void menu_sao_format(xQueueHandle button_queue) {
    pax_buf_t* pax_buffer = get_pax_buffer();
    menu_t*    menu       = menu_alloc("Program EEPROM", 20, 18);

    menu->fgColor           = 0xFF000000;
    menu->bgColor           = 0xFFFFFFFF;
    menu->bgTextColor       = 0xFF000000;
    menu->selectedItemColor = 0xFFfec859;
    menu->borderColor       = 0xFFfa448c;
    menu->titleColor        = 0xFFfec859;
    menu->titleBgColor      = 0xFFfa448c;
    menu->scrollbarBgColor  = 0xFFCCCCCC;
    menu->scrollbarFgColor  = 0xFF555555;

    menu_insert_item(menu, "Googly eye", NULL, (void*) ACTION_GOOGLY, -1);
    menu_insert_item(menu, "Cloud (with normal LEDs)", NULL, (void*) ACTION_CLOUD, -1);
    menu_insert_item(menu, "Cloud (with neopixels) 32kb", NULL, (void*) ACTION_CLOUD_TILDE, -1);
    menu_insert_item(menu, "Cloud (with neopixels) 2kb", NULL, (void*) ACTION_CLOUD_TILDE_SMALL, -1);
    menu_insert_item(menu, "Cassette", NULL, (void*) ACTION_CASSETTE, -1);
    menu_insert_item(menu, "Diskette", NULL, (void*) ACTION_DISKETTE, -1);
    menu_insert_item(menu, "SSD1306", NULL, (void*) ACTION_SSD1306, -1);
    menu_insert_item(menu, "NTAG", NULL, (void*) ACTION_NTAG, -1);
    menu_insert_item(menu, "Generic 2kb EEPROM", NULL, (void*) ACTION_SMALL, -1);

    bool              render = true;
    menu_dev_action_t action = ACTION_NONE;

    while (1) {
        rp2040_input_message_t buttonMessage = {0};
        if (xQueueReceive(button_queue, &buttonMessage, 16 / portTICK_PERIOD_MS) == pdTRUE) {
            uint8_t pin   = buttonMessage.input;
            bool    value = buttonMessage.state;
            if (value) {
                switch (pin) {
                    case RP2040_INPUT_JOYSTICK_DOWN:
                        menu_navigate_next(menu);
                        render = true;
                        break;
                    case RP2040_INPUT_JOYSTICK_UP:
                        menu_navigate_previous(menu);
                        render = true;
                        break;
                    case RP2040_INPUT_BUTTON_HOME:
                    case RP2040_INPUT_BUTTON_BACK:
                        action = ACTION_BACK;
                        break;
                    case RP2040_INPUT_BUTTON_ACCEPT:
                    case RP2040_INPUT_JOYSTICK_PRESS:
                    case RP2040_INPUT_BUTTON_SELECT:
                    case RP2040_INPUT_BUTTON_START:
                        action = (menu_dev_action_t) menu_get_callback_args(menu, menu_get_position(menu));
                        break;
                    default:
                        break;
                }
            }
        }

        if (render) {
            menu_render(pax_buffer, menu, 40, 40, 320 - 90, 220 - 90);
            display_flush();
            render = false;
        }

        if (action != ACTION_NONE) {
            if (action == ACTION_GOOGLY) {
                program_googly();
                break;
            } else if (action == ACTION_CLOUD) {
                program_cloud();
                break;
            } else if (action == ACTION_CLOUD_TILDE) {
                program_cloud_tilde();
                break;
            } else if (action == ACTION_CLOUD_TILDE_SMALL) {
                program_cloud_tilde_small();
                break;
            } else if (action == ACTION_CASSETTE) {
                program_cassette();
                break;
            } else if (action == ACTION_DISKETTE) {
                program_diskette();
                break;
            } else if (action == ACTION_SSD1306) {
                program_ssd1306();
                break;
            } else if (action == ACTION_NTAG) {
                program_ntag();
                break;
            } else if (action == ACTION_SMALL) {
                program_small();
                break;
            } else if (action == ACTION_BACK) {
                break;
            }
            action = ACTION_NONE;
            render = true;
        }
    }

