badgeteam/mch2022-firmware-esp32/main/menus/sao.c
    menu_free(menu);
}

bool sao_is_app_installed(char* name) {
    appfs_handle_t appfs_fd = appfsNextEntry(APPFS_INVALID_FD);
    while (appfs_fd != APPFS_INVALID_FD) {
        const char* slug    = NULL;
        const char* title   = NULL;
        uint16_t    version = 0xFFFF;
        appfsEntryInfoExt(appfs_fd, &slug, &title, &version, NULL);
        if ((slug != NULL) && (strlen(slug) == strlen(name)) && (strcmp(slug, name) == 0)) {
            return true;
        }
        appfs_fd = appfsNextEntry(appfs_fd);
    }
    return false;
}

void sao_start_app(char* name) {
    appfs_handle_t appfs_fd = appfsNextEntry(APPFS_INVALID_FD);
    while (appfs_fd != APPFS_INVALID_FD) {
        const char* slug    = NULL;
        const char* title   = NULL;
        uint16_t    version = 0xFFFF;
        appfsEntryInfoExt(appfs_fd, &slug, &title, &version, NULL);
        if ((slug != NULL) && (strlen(slug) == strlen(name)) && (strcmp(slug, name) == 0)) {
            appfs_boot_app(appfs_fd);
        }
        appfs_fd = appfsNextEntry(appfs_fd);
    }
}

bool sao_install_app(xQueueHandle button_queue, char* name) {
    char*  data_app_info = NULL;
    size_t size_app_info = 0;
    cJSON* json_app_info = NULL;
    char   url[128];
    snprintf(url, sizeof(url) - 1, "https://mch2022.badge.team/v2/mch2022/%s/%s/%s", "esp32", "sao", name);
    bool success = download_ram(url, (uint8_t**) &data_app_info, &size_app_info);
    if (!success) return false;
    if (data_app_info == NULL) return false;
    json_app_info = cJSON_ParseWithLength(data_app_info, size_app_info);
    if (json_app_info == NULL) return false;
    bool res = install_app(button_queue, "esp32", false, data_app_info, size_app_info, json_app_info);
    cJSON_Delete(json_app_info);
    free(data_app_info);
    return res;
}

static int intPow(int x, int n) {
    int number = 1;
    for (int i = 0; i < n; ++i) number *= x;
    return number;
}

const char neopixel_color_order_strings[][5] = {"RGB",  "RBG",  "GRB",  "GBR",  "BRG",  "BGR",  "WRGB", "WRBG", "WGRB", "WGBR",
                                                "WBRG", "WBGR", "RWGB", "RWBG", "RGWB", "RGBW", "RBWG", "RBGW", "GWRB", "GWBR",
                                                "GRWB", "GRBW", "GBWR", "GBRW", "BWRG", "BWGR", "BRWG", "BRGW", "BGWR", "BGRW"};

static const char* neopixelColorOrderToString(uint8_t color_order) {
    if (color_order > SAO_DRIVER_NEOPIXEL_COLOR_ORDER_MAX) return "unknown";
    return neopixel_color_order_strings[color_order];
}

static const char* ntagInterruptToString(uint8_t interrupt_pin) {
    if (interrupt_pin == 0) return "none";
    if (interrupt_pin == 1) return "IO1";
    if (interrupt_pin == 2) return "IO2";
    return "unknown";
}

static const char* basicioFunctionToString(uint8_t function) {
    if (function == SAO_DRIVER_BASIC_IO_FUNC_NONE) return "unused";
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED) return "LED";
    if (function == SAO_DRIVER_BASIC_IO_FUNC_BUTTON) return "button";
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_RED) return "red LED";
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_GREEN) return "green LED";
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_BLUE) return "blue LED";
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_YELLOW) return "yellow LED";
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_AMBER) return "amber LED";
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_WHITE) return "white LED";
    return "unknown";
}

static bool basicioFunctionIsLED(uint8_t function) {
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED) return true;
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_RED) return true;
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_GREEN) return true;
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_BLUE) return true;
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_YELLOW) return true;
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_AMBER) return true;
    if (function == SAO_DRIVER_BASIC_IO_FUNC_LED_WHITE) return true;
    return false;
}

bool io1_is_led = false;
bool io2_is_led = false;

static void render_sao_status(pax_buf_t* pax_buffer, SAO* sao) {
    char              stringbuf[256] = {0};
    const pax_font_t* font           = pax_font_saira_regular;
    pax_background(pax_buffer, 0xFFFFFF);
    pax_noclip(pax_buffer);

    if (sao->type == SAO_BINARY) {
        bool can_start_app = false;
        render_header(pax_buffer, 0, 0, pax_buffer->width, 34, 18, 0xFF491d88, 0xFF43b5a0, NULL, sao->name);
        for (uint8_t driver_index = 0; driver_index < sao->amount_of_drivers; driver_index++) {
            if (strncmp(sao->drivers[driver_index].name, SAO_DRIVER_APP_NAME, strlen(SAO_DRIVER_APP_NAME)) == 0) {
                can_start_app = true;
                snprintf(stringbuf, sizeof(stringbuf) - 1, "App: %s", (char*) sao->drivers[driver_index].data);
            } else if (strncmp(sao->drivers[driver_index].name, SAO_DRIVER_STORAGE_NAME, strlen(SAO_DRIVER_STORAGE_NAME)) == 0) {
                sao_driver_storage_data_t* data = (sao_driver_storage_data_t*) sao->drivers[driver_index].data;
                snprintf(stringbuf, sizeof(stringbuf) - 1, "%ukb EEPROM @0x%02x p=%u o=%u", intPow(2, data->size_exp) / 1024, data->address,
                         intPow(2, data->page_size_exp), data->data_offset);
            } else if (strncmp(sao->drivers[driver_index].name, SAO_DRIVER_NEOPIXEL_NAME, strlen(SAO_DRIVER_NEOPIXEL_NAME)) == 0) {
                sao_driver_neopixel_data_t* data = (sao_driver_neopixel_data_t*) sao->drivers[driver_index].data;
                snprintf(stringbuf, sizeof(stringbuf) - 1, "%u Neopixel LEDs (%s)", data->length, neopixelColorOrderToString(data->color_order));
            } else if (strncmp(sao->drivers[driver_index].name, SAO_DRIVER_SSD1306_NAME, strlen(SAO_DRIVER_SSD1306_NAME)) == 0) {
                sao_driver_ssd1306_data_t* data = (sao_driver_ssd1306_data_t*) sao->drivers[driver_index].data;
                snprintf(stringbuf, sizeof(stringbuf) - 1, "SSD1306 128x%u OLED display @0x%02x", data->height, data->address);
            } else if (strncmp(sao->drivers[driver_index].name, SAO_DRIVER_NTAG_NAME, strlen(SAO_DRIVER_NTAG_NAME)) == 0) {
                sao_driver_ntag_data_t* data = (sao_driver_ntag_data_t*) sao->drivers[driver_index].data;
                snprintf(stringbuf, sizeof(stringbuf) - 1, "NTAG NFC tag @0x%02x %ukb int=%s", data->address, intPow(2, data->size_exp) / 1024,
                         ntagInterruptToString(data->interrupt_pin));
            } else if (strncmp(sao->drivers[driver_index].name, SAO_DRIVER_BASIC_IO_NAME, strlen(SAO_DRIVER_BASIC_IO_NAME)) == 0) {
                sao_driver_basic_io_data_t* data = (sao_driver_basic_io_data_t*) sao->drivers[driver_index].data;
                snprintf(stringbuf, sizeof(stringbuf) - 1, "Basic I/O: %s and %s", basicioFunctionToString(data->io1_function),
                         basicioFunctionToString(data->io2_function));
                io1_is_led = basicioFunctionIsLED(data->io1_function);
                io2_is_led = basicioFunctionIsLED(data->io2_function);
            } else {
                snprintf(stringbuf, sizeof(stringbuf) - 1, "Unsupported driver \"%s\"", sao->drivers[driver_index].name);
            }
            pax_draw_text(pax_buffer, 0xFF000000, font, 18, 5, 40 + (driver_index * 18), stringbuf);
        }
        pax_draw_text(pax_buffer, 0xFF000000, font, 18, 5, 240 - 18, can_start_app ? "🅰️ Start app 🅱 back 🆂 Program" : "🅱 back 🆂 Program");
    } else if (sao->type == SAO_JSON) {
        render_header(pax_buffer, 0, 0, pax_buffer->width, 34, 18, 0xFF491d88, 0xFF43b5a0, NULL, "JSON SAO");
        pax_draw_text(pax_buffer, 0xFF000000, font, 18, 5, 40, "SAO with JSON data detected\nThis type of metadata is not supported");
        pax_draw_text(pax_buffer, 0xFF000000, font, 18, 5, 240 - 18, "🅱 back 🆂 Program");
    } else {
        render_header(pax_buffer, 0, 0, pax_buffer->width, 34, 18, 0xFF491d88, 0xFF43b5a0, NULL, "Unformatted SAO");
        pax_draw_text(pax_buffer, 0xFF000000, font, 18, 5, 240 - 18, "🅱 back 🆂 Program");
    }
}

