badgeteam/mch2022-firmware-esp32/main/menus/sao.c
static void render_sao_not_detected(pax_buf_t* pax_buffer) {
    const pax_font_t* font = pax_font_saira_regular;
    pax_background(pax_buffer, 0xFFAAAA);
    pax_noclip(pax_buffer);
    render_header(pax_buffer, 0, 0, pax_buffer->width, 34, 18, 0xFF491d88, 0xFF43b5a0, NULL, "SAO");
    pax_draw_text(pax_buffer, 0xFF000000, font, 18, 5, 40, "No SAO detected");
    pax_draw_text(pax_buffer, 0xFF000000, font, 18, 5, 240 - 18, "🅱 back");
}

static bool connect_to_wifi() {
    render_message("Connecting to WiFi...");
    display_flush();
    if (!wifi_connect_to_stored()) {
        wifi_disconnect_and_disable();
        render_message("Unable to connect to\nthe WiFi network");
        display_flush();
        wait_for_button();
        return false;
    }
    return true;
}

void reset_sao_io() {
    RP2040* rp2040 = get_rp2040();
    rp2040_set_gpio_value(rp2040, 0, false);
    rp2040_set_gpio_value(rp2040, 1, false);
    rp2040_set_gpio_dir(rp2040, 0, false);
    rp2040_set_gpio_dir(rp2040, 1, false);
}

void set_sao_io(uint8_t pin, bool value) {
    RP2040* rp2040 = get_rp2040();
    rp2040_set_gpio_dir(rp2040, pin, true);
    rp2040_set_gpio_value(rp2040, pin, value);
}

void menu_sao(xQueueHandle button_queue) {
    rp2040_input_message_t buttonMessage = {0};
    while (xQueueReceive(button_queue, &buttonMessage, 0) == pdTRUE) {
        // Flush!
    }

    pax_buf_t* pax_buffer = get_pax_buffer();
    bool       exit       = false;
    bool       identify   = true;
    SAO        sao        = {0};
    while (!exit) {
        if (identify) {
            sao_identify(&sao);
            identify = false;
        }

        // Update the EEPROM contents of the SAOs Renze handed out at MCH2022
        if (sao.type == SAO_BINARY) {
            // Update cloud SAOs with old data
            if (memcmp(sao.drivers[0].name, "hatchery", strlen("hatchery")) == 0) {
                if (memcmp(sao.name, "cloud", strlen("cloud")) == 0) {
                    program_cloud();
                    continue;
                }
            }
            // Update cassette eye SAOs with old data
            if (memcmp(sao.drivers[0].name, "hatchery", strlen("hatchery")) == 0) {
                if (memcmp(sao.name, "casette", strlen("casette")) == 0) {
                    program_cassette();
                    continue;
                } else if (memcmp(sao.name, "cassette", strlen("cassette")) == 0) {
                    program_cassette();
                    continue;
                }
            }
            // Update googly eye SAOs with old data
            if (memcmp(sao.drivers[0].name, "hatchery", strlen("hatchery")) == 0) {
                if (memcmp(sao.name, "diskette", strlen("diskette")) == 0) {
                    program_diskette();
                    continue;
                }
            }
            // Update diskette SAOs with old data
            if (memcmp(sao.drivers[0].name, SAO_DRIVER_STORAGE_NAME, strlen(SAO_DRIVER_STORAGE_NAME)) == 0) {
                if (memcmp(sao.name, "googly", strlen("googly")) == 0) {
                    program_googly();
                    continue;
                }
            }
        }

        if (sao.type != SAO_NONE) {
            render_sao_status(pax_buffer, &sao);
        } else {
            render_sao_not_detected(pax_buffer);
        }

        display_flush();

        if (xQueueReceive(button_queue, &buttonMessage, 500 / portTICK_PERIOD_MS) == pdTRUE) {
            uint8_t pin   = buttonMessage.input;
            bool    value = buttonMessage.state;
            if (value) {
                switch (pin) {
                    case RP2040_INPUT_JOYSTICK_UP:
                        if (io1_is_led) {
                            set_sao_io(0, true);
                        }
                        break;
                    case RP2040_INPUT_JOYSTICK_DOWN:
                        if (io1_is_led) {
                            set_sao_io(0, false);
                        }
                        break;
                    case RP2040_INPUT_JOYSTICK_RIGHT:
                        if (io2_is_led) {
                            set_sao_io(1, true);
                        }
                        break;
                    case RP2040_INPUT_JOYSTICK_LEFT:
                        if (io2_is_led) {
                            set_sao_io(1, false);
                        }
                        break;
                    case RP2040_INPUT_BUTTON_START:
                        menu_sao_format(button_queue);
                        identify = true;
                        break;
                    case RP2040_INPUT_BUTTON_HOME:
                    case RP2040_INPUT_BUTTON_BACK:
                        exit = true;
                        break;
                    case RP2040_INPUT_BUTTON_ACCEPT:
                        if ((sao.type == SAO_BINARY) && (strncmp(sao.drivers[0].name, "badgeteam_app_link", strlen("badgeteam_app_link")) == 0)) {
                            if (!sao_is_app_installed((char*) sao.drivers[0].data)) {
                                if (connect_to_wifi()) {
                                    render_message("Installing app...");
                                    display_flush();
                                    if (sao_install_app(button_queue, (char*) sao.drivers[0].data)) {
                                        sao_start_app((char*) sao.drivers[0].data);
                                    } else {
                                        render_message("Failed to install app");
                                        display_flush();
                                        wait_for_button();
                                    }
                                }
                            } else {
                                render_message("Starting app...");
                                display_flush();
                                sao_start_app((char*) sao.drivers[0].data);
                            }
                        }
                        identify = true;
                        break;
                    default:
                        break;
                }
            }
        }
    }

    reset_sao_io();
}
